Autodesk.Revit.DB.Solid.getGeometry
Returns the Geometry object for this solid.

Autodesk.Revit.DB.Solid.GetBoundingBox
Retrieves a box that circumscribes the solid geometry.
Remarks:
The bounding box information is stored as bounds in local coordinates and a transform.
So the transform is to be taken in to account when using the bounds.
This is different from the bounding box returned by Element.BoundingBox in that the bounding box
returned by that routine stores the bounds in modeling coordinates with an identity transform.
Since:
2014

Autodesk.Revit.DB.Solid.IntersectWithCurve(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.SolidCurveIntersectionOptions)
Calculates and returns the intersection between a curve and this solid.
curve:
The curve.
options:
The options.  If NULL, the default options will be used.
Returns:
The intersection results.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curve is not bound.
-or-
The input solid is not a closed volume.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Solid.ComputeCentroid
Returns the Centroid of this solid.
Remarks:
Calculates the centroid of the solid using an approximation, with an accuracy suitable for architectural purposes.
This will correspond only with the center of gravity if the solid represents a homogeneous structure of a single material.
Returns: The XYZ point of the Centroid of this solid.

Autodesk.Revit.DB.Solid.Volume
Returns the signed volume of this solid.
Returns: The real number equal to the signed volume of this solid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when this solid is not a valid Geometry object or the volume calculation failed.
Remarks:
Revit attempts to compute the volume analytically, if possible. If an analytical solution is not possible,
it uses tessellated faces to calculate a reasonable approximation for the volume.
The calculated volume may be slightly underestimated or overestimated if curved surfaces are present.

Autodesk.Revit.DB.Solid.SurfaceArea
Returns the total surface area of this solid.
Returns: The real number equal to the total area of this solid.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when this solid is not a valid Geometry object.
Remarks:
Calculates the surface area by adding together the areas of faces comprising this solid.
Will slightly underestimate if curved surfaces are present.

Autodesk.Revit.DB.Solid.Faces
The faces that belong to the solid.
Remarks: A face may be degenerate. This can be determined with the Face property IsTwoSided.

Autodesk.Revit.DB.Solid.Edges
The edges that belong to the solid.

Autodesk.Revit.DB.Solid
A 3d solid.
Remarks: A solid is defined by the faces and edges that form its boundary.